import React from 'react'


import './BalancePage.css'

class BalancePage extends React.Component{
    constructor(props) {
        super(props);
        
    }

    render(){
        return(
            <>
                <nav className="nav">
                    <div className="container">
                            <a href="" className="nav__prev">Главная</a>
                            <svg width="15" height="1" viewBox="0 0 15 1" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <line y1="0.75" x2="15" y2="0.75" stroke="#C2C6FF" strokeWidth="0.5"/>
                            </svg>
                            <span className="nav__current">Баланс</span>
                    </div>
                </nav>

                <main>
                    <section className="classroom-wrapper">
                            <div className="container">

                                <h1>Баланс</h1>

                                <div className="wallet-balance">
                                    <svg width="61" height="61" viewBox="0 0 61 61" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M52.1041 6.354H8.89587C3.99038 6.354 0 10.3445 0 15.2499V45.7499C0 50.6553 3.99038 54.6457 8.89587 54.6457H52.1042C57.0096 54.6457 61 50.6553 61 45.7499V15.2499C61 10.3445 57.0096 6.354 52.1041 6.354ZM58.4584 45.7499C58.4584 49.2523 55.6091 52.104 52.1042 52.104H8.89587C5.39087 52.104 2.54175 49.2523 2.54175 45.7499V15.2499C2.54175 11.7475 5.39099 8.89575 8.89587 8.89575H52.1042C55.6092 8.89575 58.4584 11.7475 58.4584 15.2499V45.7499Z" fill="white"/>
                                        <path d="M49.5625 26.6875C47.4605 26.6875 45.75 28.398 45.75 30.5C45.75 32.602 47.4605 34.3125 49.5625 34.3125C51.6645 34.3125 53.375 32.602 53.375 30.5C53.375 28.398 51.6645 26.6875 49.5625 26.6875ZM49.5625 31.7709C48.8635 31.7709 48.2916 31.2015 48.2916 30.5C48.2916 29.7985 48.8635 29.2291 49.5625 29.2291C50.2615 29.2291 50.8334 29.7985 50.8334 30.5C50.8334 31.2015 50.2615 31.7709 49.5625 31.7709Z" fill="white"/>
                                        <path d="M59.7285 21.604H49.5619C44.6565 21.604 40.666 25.5944 40.666 30.4999C40.666 35.4054 44.6564 39.3958 49.5619 39.3958H59.7285C60.43 39.3958 60.9994 38.8264 60.9994 38.1249V22.8749C60.9994 22.1734 60.43 21.604 59.7285 21.604ZM58.4578 36.854H49.5619C46.0569 36.854 43.2078 34.0023 43.2078 30.4999C43.2078 26.9975 46.057 24.1458 49.5619 24.1458H58.4578V36.854Z" fill="white"/>
                                        </svg>
                                        <div className="wallet-balance__info">
                                            <span>Ваш баланс</span>
                                            3000D
                                        </div>
                                </div>

                                <div className="balance-info">
                                    <div className="balance-info__item">
                                        <div className="balance-title">
                                            <svg width="55" height="55" viewBox="0 0 55 55" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M27.5 0C12.3368 0 0 12.3368 0 27.5C0 42.6632 12.3368 55 27.5 55C42.6632 55 55 42.6632 55 27.5C55 12.3368 42.6632 0 27.5 0ZM27.5 51.5626C14.2318 51.5626 3.43754 40.7683 3.43754 27.5001C3.43754 14.2319 14.2318 3.43754 27.5 3.43754C40.7682 3.43754 51.5626 14.2318 51.5626 27.5C51.5626 40.7682 40.7682 51.5626 27.5 51.5626Z" fill="#3888FF"/>
                                                <path d="M29.2188 13.75H25.7813V25.7813H13.75V29.2188H25.7813V41.2501H29.2188V29.2188H41.2501V25.7813H29.2188V13.75Z" fill="#3888FF"/>
                                            </svg>
                                            <h2>За что можно получить валюту?</h2>
                                        </div>
                                        <p>Рыбные тексты также применяются для демонстрации различных видов шрифта и в разработке макетов. Как правило их содержание бессмысленно. По причине своей функции текста-заполнителя для макетов нечитабельность рыбных текстов имеет особое значение.</p>
                                    </div>
                                    <div className="balance-info__item">
                                        <div className="balance-title">
                                            <svg width="55" height="55" viewBox="0 0 55 55" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M27.5 0C12.3368 0 0 12.3368 0 27.5C0 42.6632 12.3368 55 27.5 55C42.6632 55 55 42.6632 55 27.5C55 12.3368 42.6632 0 27.5 0ZM27.5 51.5626C14.2318 51.5626 3.43754 40.7683 3.43754 27.5001C3.43754 14.2319 14.2318 3.43754 27.5 3.43754C40.7682 3.43754 51.5626 14.2318 51.5626 27.5C51.5626 40.7682 40.7682 51.5626 27.5 51.5626Z" fill="#3888FF"/>
                                                <path d="M13.75 25.7812H41.25V29.2188H13.75V25.7812Z" fill="#3888FF"/>
                                            </svg>
                                            <h2>За что можно получить валюту?</h2>
                                        </div>
                                        <p>Рыбные тексты также применяются для демонстрации различных видов шрифта и в разработке макетов. Как правило их содержание бессмысленно. По причине своей функции текста-заполнителя для макетов нечитабельность рыбных текстов имеет особое значение.</p>
                                    </div>
                                </div>

                            </div>
                    </section>
                </main>
            </>
        )
    }
    
}

export default BalancePage