import React from 'react'

import './ContentProgramPage.css'
import ContentItems from './ContentItems.module'

class ContentProgramPage extends React.Component{
    render(){
        return(
            <>
                <nav className="nav">
                    <div className="container">
                            <a href="" className="nav__prev">Главная</a>
                            <svg width="15" height="1" viewBox="0 0 15 1" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <line y1="0.75" x2="15" y2="0.75" stroke="#C2C6FF" strokeWidth="0.5"/>
                            </svg>
                            <a href="" className="nav__prev">Каталог рабочих программ</a>
                            <svg width="15" height="1" viewBox="0 0 15 1" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <line y1="0.75" x2="15" y2="0.75" stroke="#C2C6FF" strokeWidth="0.5"/>
                            </svg>
                            <span className="nav__current">Содержание программы</span>
                    </div>
                </nav>

                <main>
                    <section>
                            <div className="container">
                                    
                                <div className="subject">
                                    <div className="subject__contant">
                                        <div className="subject__contant-disc">
                                            <h4>9 класс</h4>
                                            <h1>Биология</h1>
                                            <span>Введение в общую биологию <br/> В.В. Пасечник, А.А. Каменский</span>
                                        </div>
                                    </div>
                                    <div className="subject__wrapper-btn">
                                        <button className="btn btn-green svg-position-btn">
                                            <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M15.7728 8.94533L14.8941 7.94533C14.6514 7.66933 14.2314 7.64267 13.9541 7.884L11.3341 10.18V0.666667C11.3341 0.298667 11.0354 0 10.6674 0H9.3341C8.9661 0 8.66743 0.298667 8.66743 0.666667V10.18L6.04743 7.884C5.77143 7.64267 5.35143 7.66933 5.10743 7.94533L4.22877 8.944C3.98477 9.22133 4.01277 9.644 4.2901 9.88667L9.5621 14.5013C9.8141 14.7213 10.1888 14.7213 10.4408 14.5013L15.7114 9.88667C15.9888 9.644 16.0168 9.22133 15.7728 8.94533Z" fill="white"/>
                                                <path d="M17.3333 17.333H2.66667C2.29867 17.333 2 17.6317 2 17.9997V19.333C2 19.701 2.29867 19.9997 2.66667 19.9997H17.3333C17.7013 19.9997 18 19.701 18 19.333V17.9997C18 17.6317 17.7013 17.333 17.3333 17.333Z" fill="#3888FF"/>
                                            </svg>
                                            <span>Скачать программу</span>
                                        </button>
                                        <button className="btn btn-green svg-position-btn">
                                            <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M9.44851 0.802551C9.55206 0.592769 9.7657 0.459961 9.99967 0.459961C10.2336 0.45992 10.4473 0.592728 10.5509 0.802511L12.9483 5.65944C13.1737 6.11613 13.6094 6.43275 14.1135 6.50595L19.4737 7.28515C19.7052 7.31883 19.8975 7.48097 19.9699 7.70349C20.0421 7.92598 19.9819 8.17025 19.8144 8.33357L15.936 12.1146C15.5713 12.4701 15.4049 12.9823 15.4909 13.4843L16.406 18.822C16.4455 19.0526 16.3508 19.2857 16.1615 19.4231C15.9722 19.5607 15.7213 19.5787 15.5142 19.4698L10.7198 16.9498C10.269 16.7128 9.73044 16.7128 9.27955 16.9499L4.4856 19.4698C4.27849 19.5787 4.02757 19.5605 3.83832 19.423C3.64903 19.2855 3.55428 19.0524 3.5938 18.8219L4.50934 13.4845C4.59548 12.9824 4.42904 12.4701 4.06425 12.1145L0.185631 8.33361C0.0181296 8.17029 -0.0422081 7.92602 0.0300998 7.70354C0.102408 7.48105 0.294742 7.31891 0.526273 7.28519L5.88631 6.50603C6.39036 6.43275 6.82611 6.11617 7.05156 5.6594L9.44851 0.802551Z" fill="#3888FF"/>
                                            </svg>
                                            <span>Добавить в избранное</span>
                                        </button>
                                        <button className="btn btn-green svg-position-btn">
                                            <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M18.5721 5.71387H1.42862C0.640023 5.71387 0 6.34746 0 7.13678V14.2799H2.85724V17.14C2.85724 17.9279 3.49584 18.5658 4.28301 18.5658H15.7127C16.5027 18.5658 17.1428 17.9257 17.1428 17.1357V14.2799H20V7.14249C20.0007 6.35389 19.3607 5.71387 18.5721 5.71387ZM2.85724 8.57111H1.42862V7.14249H2.85724V8.57111ZM15.7148 17.1428H4.28587V9.99402H15.7148V17.1428Z" fill="#3888FF"/>
                                                <path d="M17.1436 1.43359H2.85742V4.27941H17.1436V1.43359Z" fill="#3888FF"/>
                                                <path d="M14.2866 11.4287H5.71484V12.8573H14.2866V11.4287Z" fill="#3888FF"/>
                                                <path d="M14.2866 14.2861H5.71484V15.7148H14.2866V14.2861Z" fill="#3888FF"/>
                                            </svg>
                                            <span>Распечатать программу</span>
                                        </button>
                                    </div>
                                </div>

                                <div className="contant-program">
                                    <h1>Содержание программы</h1>
                                    <ul className="contant-program__list">
                                        <ContentItems items={[
                                            {
                                                text: 'Рыбные тексты также применяются для демонстрации различных видов шрифта'
                                            },
                                            {
                                                text: 'В разработке макетов. Как правило их содержание бессмысленно.'
                                            },
                                            {
                                                text: 'По причине своей функции текста-заполнителя для макетов нечитабельность рыбных'
                                            },
                                            {
                                                text: 'В случае произвольного набора букв и длины слов ничто не отвлекает от оценки воздействия'
                                            },
                                            {
                                                text: 'Читаемости различных шрифтов, а также от распределения текста на странице (макет или площадь набора).'
                                            }
                                        ]}/>
                                    </ul>
                                </div>
                                    
                            </div>
                    </section>
                </main>
            </>
        )
    }
}

export default ContentProgramPage